In [1]:
import numpy as np

import pandas as pd

import matplotlib.pyplot as plt

import plotly.express as px

import seaborn as sns

In [3]:
# Read the CSV file and load into a DataFrame
df = pd.read_csv('covid_worldwide.csv')
df

,Serial Number,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Test,Population
0,1,USA,"104,196,861","1,132,935","101,322,779","1,741,147","1,159,832,679","334,805,269"
1,2,India,"44,682,784","530,740","44,150,289","1,755","915,265,788","1,406,631,776"
2,3,France,"39,524,311","164,233","39,264,546","95,532","271,490,188","65,584,518"
3,4,Germany,"37,779,833","165,711","37,398,100","216,022","122,332,384","83,883,596"
4,5,Brazil,"36,824,580","697,074","35,919,372","208,134","63,776,166","215,353,593"
...,...,...,...,...,...,...,...,...
226,227,Diamond Princess,712,13,699,0,NaN,NaN
227,228,Vatican City,29,NaN,29,0,NaN,799
228,229,Western Sahara,10,1,9,0,NaN,"626,161"
229,230,MS Zaandam,9,2,7,0,NaN,NaN
230,231,Tokelau,5,NaN,NaN,5,NaN,"1,378"

In [4]:
# Print the shape of the DataFrame
print(df.shape)

(231, 8)

In [5]:
#Df info.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 231 entries, 0 to 230
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Serial Number    231 non-null    int64
 1   Country          231 non-null    object
 2   Total Cases      231 non-null    object
 3   Total Deaths     225 non-null    object
 4   Total Recovered  210 non-null    object
 5   Active Cases     212 non-null    object
 6   Total Test       213 non-null    object
 7   Population       228 non-null    object
dtypes: int64(1), object(7)
memory usage: 14.6+ KB

In [6]:
#Delete elements from the dataframe with different data types

# 1. Make a copy of the original DataFrame
df_copy = df.copy()

# Delete elements with non-numeric data types
df_copy = df_copy.select_dtypes(include=['object'])

#Df info.
df_copy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 231 entries, 0 to 230
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          231 non-null    object
 1   Total Cases      231 non-null    object
 2   Total Deaths     225 non-null    object
 3   Total Recovered  210 non-null    object
 4   Active Cases     212 non-null    object
 5   Total Test       213 non-null    object
 6   Population       228 non-null    object
dtypes: object(7)
memory usage: 12.8+ KB

In [15]:
# 1. Add a new column called 'nulos' where we are going to save the sum of the null values on each row of the dataframe
df_copy ['nulos'] = df_copy.isnull().sum(axis=1)

# 2. calculate the total number of columns in the dataframe
num_cols = df_copy.shape[1]

# 3. Calculate the percentage of the null values
df_copy['Porcentaje_null'] = df_copy['nulos'] / num_cols

# 4. Since the request isn't complete clear, we are assuming that we have to create a new dataframe where the rows correspond with the following condition where we are validating that the null values are less or equal than the 50 percent of the total row data
df_copy[df_copy['Porcentaje_null'] <= 0.5]

df_copy

,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Test,Population,nulos,Porcentaje_null
0,USA,"104,196,861","1,132,935","101,322,779","1,741,147","1,159,832,679","334,805,269",0,0.000000
1,India,"44,682,784","530,740","44,150,289","1,755","915,265,788","1,406,631,776",0,0.000000
2,France,"39,524,311","164,233","39,264,546","95,532","271,490,188","65,584,518",0,0.000000
3,Germany,"37,779,833","165,711","37,398,100","216,022","122,332,384","83,883,596",0,0.000000
4,Brazil,"36,824,580","697,074","35,919,372","208,134","63,776,166","215,353,593",0,0.000000
...,...,...,...,...,...,...,...,...,...
226,Diamond Princess,712,13,699,0,NaN,NaN,2,0.222222
227,Vatican City,29,NaN,29,0,NaN,799,2,0.222222
228,Western Sahara,10,1,9,0,NaN,"626,161",1,0.111111
229,MS Zaandam,9,2,7,0,NaN,NaN,2,0.222222
230,Tokelau,5,NaN,NaN,5,NaN,"1,378",3,0.333333

In [18]:
# check if there are duplicated entries on the country column

df_copy[df_copy.duplicated('Country', False)]

Empty DataFrame
Columns: [Country, Total Cases, Total Deaths, Total Recovered, Active Cases, Total Test, Population, nulos, Porcentaje_null]
Index: []

In [26]:
# Read the data with thousands formatting
df_copy_th = pd.read_csv ('covid_worldwide.csv',thousands=',')
df_copy_th = df_copy_th.drop(labels= 'Serial Number', axis= 1)
df_copy_th.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 231 entries, 0 to 230
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Country          231 non-null    object
 1   Total Cases      231 non-null    int64
 2   Total Deaths     225 non-null    float64
 3   Total Recovered  210 non-null    float64
 4   Active Cases     212 non-null    float64
 5   Total Test       213 non-null    float64
 6   Population       228 non-null    float64
dtypes: float64(5), int64(1), object(1)
memory usage: 12.8+ KB

In [27]:
df_copy_th

,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Test,Population
0,USA,104196861,1132935.0,101322779.0,1741147.0,1.159833e+09,3.348053e+08
1,India,44682784,530740.0,44150289.0,1755.0,9.152658e+08,1.406632e+09
2,France,39524311,164233.0,39264546.0,95532.0,2.714902e+08,6.558452e+07
3,Germany,37779833,165711.0,37398100.0,216022.0,1.223324e+08,8.388360e+07
4,Brazil,36824580,697074.0,35919372.0,208134.0,6.377617e+07,2.153536e+08
...,...,...,...,...,...,...,...
226,Diamond Princess,712,13.0,699.0,0.0,NaN,NaN
227,Vatican City,29,NaN,29.0,0.0,NaN,7.990000e+02
228,Western Sahara,10,1.0,9.0,0.0,NaN,6.261610e+05
229,MS Zaandam,9,2.0,7.0,0.0,NaN,NaN
230,Tokelau,5,NaN,NaN,5.0,NaN,1.378000e+03

In [28]:
# Calculate the percentage of deaths by country
df_copy_th['P_deaths_by_country'] = (
    (df_copy_th['Total Deaths']/df_copy_th['Total Cases']))*100

# Round the percentage to twice units
df_copy_th['P_deaths_by_country'] = df_copy_th['P_deaths_by_country'].round(2)

df_copy_th

,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Test,Population,P_deaths_by_country
0,USA,104196861,1132935.0,101322779.0,1741147.0,1.159833e+09,3.348053e+08,1.09
1,India,44682784,530740.0,44150289.0,1755.0,9.152658e+08,1.406632e+09,1.19
2,France,39524311,164233.0,39264546.0,95532.0,2.714902e+08,6.558452e+07,0.42
3,Germany,37779833,165711.0,37398100.0,216022.0,1.223324e+08,8.388360e+07,0.44
4,Brazil,36824580,697074.0,35919372.0,208134.0,6.377617e+07,2.153536e+08,1.89
...,...,...,...,...,...,...,...,...
226,Diamond Princess,712,13.0,699.0,0.0,NaN,NaN,1.83
227,Vatican City,29,NaN,29.0,0.0,NaN,7.990000e+02,NaN
228,Western Sahara,10,1.0,9.0,0.0,NaN,6.261610e+05,10.00
229,MS Zaandam,9,2.0,7.0,0.0,NaN,NaN,22.22
230,Tokelau,5,NaN,NaN,5.0,NaN,1.378000e+03,NaN

In [36]:
# Top 10 countries with the highest number of deaths
top_10_countries_highest = df_copy_th.groupby('Country')['P_deaths_by_country'].sum().nlargest(10)
top_10_countries_highest

Country
MS Zaandam                22.22
Yemen                     18.07
Western Sahara            10.00
Sudan                      7.85
Syria                      5.51
Somalia                    4.98
Peru                       4.89
Egypt                      4.77
Mexico                     4.51
Bosnia and Herzegovina     4.05
Name: P_deaths_by_country, dtype: float64

In [37]:
# Top 10 countries with the smallest number of deaths
top_10_countries_smallest = df_copy_th.groupby('Country')['P_deaths_by_country'].sum().nsmallest(10)
top_10_countries_smallest

Country
DPRK                0.00
Falkland Islands    0.00
Niue                0.00
Saint Helena        0.00
Tokelau             0.00
Tuvalu              0.00
Vatican City        0.00
Nauru               0.02
Bhutan              0.03
Cook Islands        0.03
Name: P_deaths_by_country, dtype: float64

In [38]:
# Calculate the percentage of Recovered by country
df_copy_th['P_recovered_by_country'] = (
    (df_copy_th['Total Recovered']/df_copy_th['Total Cases']))*100

# Round the percentage to twice units
df_copy_th['P_recovered_by_country'] = df_copy_th['P_recovered_by_country'].round(
    2)

df_copy_th

,Country,Total Cases,Total Deaths,Total Recovered,Active Cases,Total Test,Population,P_deaths_by_country,P_recovered_by_country
0,USA,104196861,1132935.0,101322779.0,1741147.0,1.159833e+09,3.348053e+08,1.09,97.24
1,India,44682784,530740.0,44150289.0,1755.0,9.152658e+08,1.406632e+09,1.19,98.81
2,France,39524311,164233.0,39264546.0,95532.0,2.714902e+08,6.558452e+07,0.42,99.34
3,Germany,37779833,165711.0,37398100.0,216022.0,1.223324e+08,8.388360e+07,0.44,98.99
4,Brazil,36824580,697074.0,35919372.0,208134.0,6.377617e+07,2.153536e+08,1.89,97.54
...,...,...,...,...,...,...,...,...,...
226,Diamond Princess,712,13.0,699.0,0.0,NaN,NaN,1.83,98.17
227,Vatican City,29,NaN,29.0,0.0,NaN,7.990000e+02,NaN,100.00
228,Western Sahara,10,1.0,9.0,0.0,NaN,6.261610e+05,10.00,90.00
229,MS Zaandam,9,2.0,7.0,0.0,NaN,NaN,22.22,77.78
230,Tokelau,5,NaN,NaN,5.0,NaN,1.378000e+03,NaN,NaN

In [39]:
# Top 10 countries with the highest number of recovered cases
top_10_countries_recovered = df_copy_th.groupby(
    'Country')['P_recovered_by_country'].sum().nlargest(10)
top_10_countries_recovered

Country
DPRK                100.00
Falkland Islands    100.00
Vatican City        100.00
Niue                 99.87
Palau                99.83
Burundi              99.82
Qatar                99.81
Mongolia             99.78
Cook Islands         99.74
Nauru                99.74
Name: P_recovered_by_country, dtype: float64